INSERT INTO users (id, username) VALUES
                                     (1, 'user1'),
                                     (2, 'user2'),
                                     (3, 'anonim'),
                                     (4, 'alex')
    ON CONFLICT (id) DO NOTHING;

INSERT INTO landmark (id, name, city, latitude, longitude, avg_rating, category) VALUES
                                                                                     (1, 'Самарская набережная', 'Самара', 53.181827, 50.100994, 4.5, 'Парк'),
                                                                                     (2, 'Бункер Сталина', 'Самара', 50.1967, 50.0981, 5, 'Музей'),
                                                                                     (3, 'Монумент «Ладья»', 'Самара', 53.2159, 50.1322, 0, 'Памятник'),
                                                                                     (4, 'Музей «Самара космическая»', 'Самара', 50.212657, 50.145262, 0, 'Музей'),
                                                                                     (5, 'Жигулевский пивоваренный завод', 'Самара', 53.2006, 50.0972, 0, 'Здание'),
                                                                                     (6, 'Храм Пресвятого Сердца Иисуса', 'Самара', 53.1938, 50.0959, 0, 'Собор'),
                                                                                     (7, 'Площадь Славы', 'Самара', 53.203398, 50.110335, 0, 'Парк'),
                                                                                     (8, 'Улица Ленинградская', 'Самара', 53.186431, 50.095765, 0, 'Улица'),
                                                                                     (9, 'Музей Эльдара Рязанова', 'Самара', 53.192706, 50.094507, 0, 'Музей'),
                                                                                     (10, 'Дом со слонами', 'Самара', 53.247292, 50.173365, 0, 'Здание'),
                                                                                     (11, 'Пещера братьев Греве', 'Самара', 53.3252, 50.1952, 0, 'Парк'),
                                                                                     (12, 'Фабрика-кухня', 'Самара', 53.215961, 50.148804, 0, 'Музей')
    ON CONFLICT (id) DO NOTHING;

-- Отзывы
INSERT INTO reviews (landmark_id, user_id, rating, text, created_at) VALUES
                                                                        (1, 1, 4, 'не понравились фильмы в "Филин"', '2026-06-25 20:28:33.595443'),
                                                                        (1, 3, 4, 'много людей', '2026-06-27 22:24:28.57388'),
                                                                        (1, 4, 5, NULL, '2026-06-28 15:23:02.570498')
    ON CONFLICT DO NOTHING;